
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Аукцион = Справочники.Аукционы.НайтиПоНаименованию(Объект.Наименование);
	Пар = Аукцион.ПолучитьОбъект();
	Если Объект.ДатаНачала < ТекущаяДата() и 
		Объект.СтатусАукциона<>Перечисления.СтатусыАукциона.Начат Тогда
		Пар.СтатусАукциона = Перечисления.СтатусыАукциона.Начат;
		Пар.Записать();
	КонецЕсли;            
	Если Объект.ДатаКонца < ТекущаяДата() и 
		Объект.СтатусАукциона<>Перечисления.СтатусыАукциона.Завершен Тогда
		Пар.СтатусАукциона = Перечисления.СтатусыАукциона.Завершен;
		Пар.Записать();
	КонецЕсли;
КонецПроцедуры

