
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ОтобратьЛоты", 1);
КонецПроцедуры

&НаКлиенте
Процедура ОтобратьЛоты()
	Аукцион = Элементы.Список.ТекущаяСтрока;
	Пар = ЛотыСписок.Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Владелец"));
	Если Пар.Значение<>Аукцион Тогда 
		ЛотыСписок.Параметры.УстановитьЗначениеПараметра("Владелец", Аукцион);
		Элементы.ЛотыСписок.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЛотыСписок.Параметры.УстановитьЗначениеПараметра("Владелец", Справочники.Аукционы.ПустаяСсылка());
	ЛотыСписок.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
КонецПроцедуры
