
&НаКлиенте
Процедура Зарегистрироваться(Команда)
	ЗарегистрироватьсяНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьсяНаСервере()
	Если Пароль<>ПодтверждениеПароля Тогда 
		Сообщить("Пароли не совпадают!");
		Возврат;
	КонецЕсли;
	
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	
	НовыйПользователь.Имя = ФИО;
	НовыйПользователь.ПолноеИмя = ФИО;
	НовыйПользователь.ПоказыватьВСпискеВыбора = истина;
	
	НовыйПользователь.АутентификацияСтандартная = истина;
	НовыйПользователь.Пароль = Пароль;	
	Попытка 
		НовыйПользователь.Записать();
		
	Исключение
		ВызватьИсключение;
	КонецПопытки;
	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = ФИО;
	Пользователь.ТипПользователя = ТипПользователя;
	Пользователь.ЭлектроннаяПочта = ЭлектроннаяПочта;
	Пользователь.Телефон = Телефон;
	Пользователь.Адрес = Адрес;
	Пользователь.Записать();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Пароль.РежимПароля = истина;
	Элементы.ПодтверждениеПароля.РежимПароля = истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипПользователяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если РольДоступнаАдминистратор() Тогда
		СтандартнаяОбработка = ложь;
		ДанныеВыбора = новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипПользователя.Покупатель"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипПользователя.Продавец"));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступнаАдминистратор()
	Возврат не РольДоступна("ПолныеПрава");
КонецФункции

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры





