
&НаКлиенте
Процедура Зарегистрироваться(Команда)
	ЗарегистрироватьсяНаСервере();
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьсяНаСервере() 
	Если Пароль<>ПодтверждениеПароля Тогда 
		Сообщить("Пароли не совпадают!");
		Возврат;
	КонецЕсли;
	
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	
	НовыйПользователь.Имя = ФИО;
	НовыйПользователь.ПолноеИмя = ФИО;
	НовыйПользователь.ПоказыватьВСпискеВыбора = истина;
	
	НовыйПользователь.АутентификацияСтандартная = истина;
	НовыйПользователь.Пароль = Пароль;
	НовыйПользователь.Роли.Добавить(Метаданные.Роли.ТекущийПользовательПолучение);
	Если ТипПользователя = Перечисления.ТипПользователя.Покупатель Тогда 
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.АукционыПросмотр);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ЛотыПросмотр);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПользователиПросмотр);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ИзбранныеЛотыДобавление);
	ИначеЕсли ТипПользователя = Перечисления.ТипПользователя.Менеджер Тогда
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.АукционыЗапись);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ЛотыРедактирование);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПриемОплатыДобавление);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПользователиПросмотр);
	ИначеЕсли ТипПользователя = Перечисления.ТипПользователя.Продавец Тогда
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ПользователиПросмотр);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.АукционыПросмотр);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ИзбранныеЛотыДобавление);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ИзбранныеЛотыПросмотр);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ЛотыДобавление);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.ЛотыПросмотр);
		НовыйПользователь.Роли.Добавить(Метаданные.Роли.БонуснаяПрограммаДобавление);
	КонецЕсли;
	
	ЗаписатьНовогоПользователя(НовыйПользователь);	
	Пользователь = Справочники.Пользователи.СоздатьЭлемент();
	Пользователь.Наименование = ФИО;
	Пользователь.ТипПользователя = ТипПользователя;
	Пользователь.ЭлектроннаяПочта = ЭлектроннаяПочта;
	Пользователь.Телефон = Телефон;
	Пользователь.Адрес = Адрес;
	Пользователь.Записать();

КонецПроцедуры

Процедура ЗаписатьНовогоПользователя(НовыйПользователь) Экспорт
	УстановитьПривилегированныйРежим(Истина);
	НовыйПользователь.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Пароль.РежимПароля = истина;
	Элементы.ПодтверждениеПароля.РежимПароля = истина;
КонецПроцедуры

&НаКлиенте
Процедура ТипПользователяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если РольДоступнаАдминистратор() Тогда
		СтандартнаяОбработка = ложь;
		ДанныеВыбора = новый СписокЗначений;
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипПользователя.Покупатель"));
		ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ТипПользователя.Продавец"));
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция РольДоступнаАдминистратор()
	Возврат не РольДоступна("ПолныеПрава");
КонецФункции

&НаКлиенте
Процедура Отменить(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры





