
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрВзаиморасчетов Приход
	Движения.РегистрВзаиморасчетов.Записывать = Истина;
	Движение = Движения.РегистрВзаиморасчетов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Аукцион = Аукцион;
	Движение.ПриемОплаты = Ссылка;
	Движение.СуммаКОплате = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Аукционы") Тогда
		// Заполнение шапки
		Сумма = ДанныеЗаполнения.Лоты;
		Наименование = ДанныеЗаполнения.НаименованиеАукциона;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Плательщик = ДанныеЗаполнения.Участники;
		Аукцион = Ссылка;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
