
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Лоты") Тогда
	// Заполнение шапки
		Аукцион = ДанныеЗаполнения.Владелец;
		Ответственный = ДанныеЗаполнения.Владелец.Ответственный;
		Лот = ДанныеЗаполнения.Наименование;
		ТипОплаты = Перечисления.ТипОплаты.ОплатаПокупки;
		СсылкаЛот = Справочники.Лоты.НайтиПоНаименованию(ДанныеЗаполнения.Наименование);
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		| СтавкиНаЛотыСрезПоследних.Лот КАК Лот,
		| СтавкиНаЛотыСрезПоследних.Пользователь,
		| СтавкиНаЛотыСрезПоследних.Ставка
		|ИЗ
		| РегистрСведений.СтавкиНаЛоты.СрезПоследних(&ТекущаяДата, Лот = &Лот) КАК СтавкиНаЛотыСрезПоследних";
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Запрос.УстановитьПараметр("Лот", СсылкаЛот);
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			Плательщик = РезультатЗапроса.Пользователь; 
			Если Справочники.БонуснаяПрограмма.НайтиПоРеквизиту("Покупатель", РезультатЗапроса.Пользователь).Владелец = РезультатЗапроса.Лот.Продавец Тогда
				ПроцентБонуса = Справочники.БонуснаяПрограмма.НайтиПоРеквизиту("Покупатель", РезультатЗапроса.Пользователь).ПроцентБонуса;
				Бонус = ПроцентБонуса / 100;
				Сумма = РезультатЗапроса.Ставка - РезультатЗапроса.Ставка * Бонус;
			Иначе
				Сумма = РезультатЗапроса.Ставка;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
